Repository: dongri727/chronomap-in-space
Catalog: lib/l10n/app_*.arb
Languages: fr, ja

# cover
source: assets/images/cover_en.png
fr: assets/images/cover_fr.png
ja: assets/images/cover_ja.png

# infoA
source: This is an application specialized in the input and output of data related to the universe from the "ChronoMap". The "ChronoMap" is a database that encompasses all historical events from the origin of the universe to the endless 'now,' without regard to field. It aims to accurately display temporal and spatial distances, with 'when' and 'where' as mandatory items.
fr: Il s'agit d'une application spécialisée dans l'entrée et la sortie de données liées à l'univers de la "ChronoMap". La "ChronoMap" est une base de données qui englobe tous les événements historiques depuis l'origine de l'univers jusqu'à l'éternel 'maintenant,' sans égard au domaine. Elle vise à afficher correctement les distances temporelles et spatiales, avec 'quand' et 'où' comme éléments obligatoires.
ja: これは『四次元年表』のうち、宇宙に関連するデータの入・出力に特化したアプリです。『四次元年表』とは宇宙の始原から終わりなき「今」に至る、全ての歴史的事象を、分野にかかわらず網羅するデータベースです。「いつ」だけでなく、｢どこで｣を必須項目とし、時間的距離、空間的距離を正しく表示することを目指します。

# infoB
source: Web version of "ChronoMap"
fr: Version web de la "ChronoMap"
ja: web版『四次元年表』

# infoC
source: Web version of three-dimensional and four-dimensional views
fr: Version web des vues 3D et 4D
ja: web版三次元・四次元表示

# infoD
source: How to use the "ChronoMap"
fr: Comment utiliser la "ChronoMap"
ja: 『四次元年表』の使い方

# infoE
source: This app does not acquire any of your personal information, nor does it track or use information on your device.
fr: Cette application ne récupère aucune de vos informations personnelles, ni ne suit ni n'utilise les informations de votre appareil.
ja: このアプリは、あなたのどんな個人情報も一切取得しませんし、あなたのデバイス中の情報を追跡、利用することもありません。

# infoF
source: The historical information you register is not linked to you. There are no records of what you register or search for.
fr: Les informations historiques que vous enregistrez ne vous sont pas liées. Il n'y a pas d'enregistrement de ce que vous inscrivez ou recherchez.
ja: あなたが登録してくださった歴史情報があなたと紐付けられることはありません。あなたがなにを登録し、なにを検索したかはについて、記録は一切残りません。

# infoG
source: Information contrary to the purpose of the "ChronoMap" will be handled by the administrator as follows. 1. Correction 2. Viewing stop (may be made public in the future) 3. Deletion
fr: Les informations contraires aux objectifs de la "ChronoMap" seront traitées par l'administrateur de la manière suivante. 1. Correction 2. Arrêt de la visualisation (peut être rendu public à l'avenir) 3. Suppression
ja: 『四次元年表』の趣旨に反する情報は、運営者によって以下の対応を取ります。 １、修正 ２、閲覧停止（将来公開される可能性あり） ３、削除

# infoH
source: The historical information you register is treated as a public good, and you yourself cannot delete it. Please be careful not to write personal information. If you want to delete information registered by mistake or find information that should be deleted, please contact the following address.
fr: Les informations historiques que vous enregistrez sont traitées comme un bien public, et vous-même ne pouvez pas les supprimer. Veuillez faire attention à ne pas écrire d'informations personnelles. Si vous souhaitez supprimer des informations enregistrées par erreur ou trouver des informations qui devraient être supprimées, veuillez contacter l'adresse suivante.
ja: 登録いただいた歴史情報は公共財として扱われ、登録したあなた自身でも削除することはできません。個人情報等を書き込まないようご注意ください。誤って登録した情報を削除したい場合、また、削除すべきと思われる情報を見つけた場合は、下記までご連絡ください。

# infoI
source: We are looking for people to join us in developing the "ChronoMap." If you are an engineer who can handle Flutter, AWS, PostgreSQL, Unity, etc., or can assist with data entry and correction, please contact us below.
fr: Nous recherchons des personnes pour nous rejoindre dans le développement de la "ChronoMap." Si vous êtes un ingénieur capable de gérer Flutter, AWS, PostgreSQL, Unity, etc., ou pouvez aider à la saisie et à la correction des données, veuillez nous contacter ci-dessous.
ja: 『四次元年表』開発をともにする方を求めています。Flutter、AWS、PostgreSQL, Unity等を扱えるエンジニアほか、データ入力やデータ修正等にご協力いただける方は、下記までご連絡ください。

# addHintA
source: In the "ChronoMap", a historical event refers to a single occurrence with information on "when and where." For example, "Saturn Exploration by Cassini" is not considered a single occurrence. The registration would be "September 15, 2017: Cassini Probe Enters Saturnâ€™s Atmosphere, Solar System, Saturn." If you want to make this searchable as "Saturn Exploration by Cassini," please add the term "Cassini-Huygens" in the web version of the "ChronoMap".
fr: Dans la "ChronoMap", un événement historique fait référence à une occurrence unique avec des informations sur "quand et où." Par exemple, "L'exploration de Saturne par Cassini" n'est pas considéré comme une occurrence unique. L'inscription serait "15 septembre 2017 : Cassini entre dans l'atmosphère de Saturne, Système Solaire, Saturne." Si vous souhaitez rendre cela consultable sous "L'exploration de Saturne par Cassini," veuillez ajouter le terme "Cassini-Huygens" dans la version web de la "ChronoMap".
ja: 『四次元年表』における歴史的事象とは、「いつ、どこで」の情報を備えた、単一のできごとを指します。例えば「カッシーニによる土星探査」は単一のできごととはみなされません。登録は 「2017年9月15日 カッシーニ本体土星大気圏に突入 太陽系 土星」のようになります。これを｢カッシーニによる土星探査｣として検索可能にしたい場合は、web版｢四次元年表｣において、termに「カッシーニ・ホイヘンス」を追加してください。

# addHintB
source: Due to the confirmation work of location information, three-dimensional displays of space-related data are not updated in real-time. To expedite the work, we would appreciate your cooperation in inputting heliocentric ecliptic coordinates, Julian dates, galactic coordinates, light-year distances, etc., if possible.
fr: En raison du travail de confirmation des informations de localisation, les affichages tridimensionnels des données liées à l'espace ne sont pas mis à jour en temps réel. Pour accélérer le travail, nous apprécierions votre coopération en saisissant les coordonnées écliptiques héliocentriques, les dates juliennes, les coordonnées galactiques, les distances en années-lumière, etc., si possible.
ja: 宇宙関連のデータは、位置情報確定作業のため、三次元表示はリアルタイムで更新されません。作業の迅速化のため、可能であれば、日心黄道座標やユリウス日、銀河座標、光年距離などの入力にご協力いただければ幸いです。

# addHintC
source: For launch information of probes, etc., we would appreciate it if you could specify the launch site in addition to "Solar System" and "Earth."
fr: Pour les informations de lancement de sondes, etc., nous vous serions reconnaissants de bien vouloir spécifier le site de lancement en plus de "Système Solaire" et "Terre."
ja: 探査機等の打ち上げ情報については、「太陽系」「地球」のほかに、打ち上げ場を特定していただけると幸いです。

# indexA
source: Register Events
fr: Enregistrer des Evénements
ja: 事象登録

# indexB
source: Scalable View
fr: Vue Evolutive
ja: 伸縮時間軸

# indexC
source: Database 3D View
fr: Vue 3D de la base de données
ja: 三次元表示

# indexD
source: Interstellar Missions
fr: Missions Interstellaires
ja: 星間探査船

# indexE
source: Planetary Exploration
fr: Exploration Planétaire
ja: 惑星探査

# name
source: Event(within 50 letters)
fr: Evénement(dans les 50 lettres)
ja: 事象名（50文字以内）

source: Show Options
fr: Efficher et sélectionner des options
ja: 選択肢を表示

# newWord
source: another Celestrial Body or Space Probe you want
fr: Entrez le nom de l'objet céleste ou de la sonde manquant
ja: 追加したい天体名・探査船名を記入

# addWord
source: add a new word
fr: Ajouter le mot
ja: 記入した名称を追加

# newSite
source: another launch site you want
fr: Entrez le nom du site de lancement manquant
ja: 追加したい打ち上げ場を記入

# ifYouMayKnow
source: Please enter if you may know
fr: Si possible, veuillez également entrer les informations suivantes
ja: 可能なら以下もご記入ください

# isMissionA
source: This page displays the trajectories of spacecraft that have left or are expected to leave the heliosphere using heliocentric ecliptic coordinates. Currently, the trajectories of Pioneer 10 (until the end of its mission), Voyager 1 (up to 2004), and Voyager 2 (up to 2004) are included. If you can assist with extending the trajectories of the Voyager spacecraft and creating the trajectories for Pioneer 11 and New Horizons, please contact us at the address below.
fr: Cette page affiche les trajectoires des sondes spatiales qui ont quitté ou qui sont censées quitter l'héliosphère en utilisant les coordonnées écliptiques héliocentriques. Actuellement, les trajectoires de Pioneer 10 (jusqu'à la fin de sa mission), Voyager 1 (jusqu'en 2004), et Voyager 2 (jusqu'en 2004) sont incluses. Si vous pouvez aider à étendre les trajectoires des sondes Voyager et à créer les trajectoires pour Pioneer 11 et New Horizons, veuillez nous contacter à l'adresse ci-dessous.
ja: これは、太陽圏を離脱した、または離脱予定の探査機の航跡を日心黄道座標によって表示するページです。現在、パイオニア10号（運用終了まで）、ボイジャー1号(2004年まで)、ボイジャー2号(2004年まで)が掲載されています。ボイジャー2機の航跡延長、およびパイオニア11号、ニュー・ホライズンズの航跡作成にご協力いただける方は、下記にご連絡ください。

# isMissionB
source: We use heliocentric ecliptic coordinates with the Sun at the center. The concentric circles in the center represent the orbits of Earth, Mars, Jupiter, Saturn, Uranus, and Neptune.
fr: Nous utilisons les coordonnées écliptiques héliocentriques avec le Soleil au centre. Les cercles concentriques au centre représentent les orbites de la Terre, Mars, Jupiter, Saturne, Uranus et Neptune.
ja: 太陽を中心とする日心黄道座標を用いています。中央の同心円は、地球・火星・木星・土星・天王星・海王星の公転軌道です。

# isMissionC
source: The spherical point cloud indicates the approximate size of the heliosphere.
fr: Le nuage de points sphériques indique la taille approximative de l'héliosphère.
ja: 球状の点描は太陽圏のおおよその大きさです。

# isMissionD
source: The three axes correspond to the Pisces-Virgo line, the Gemini-Sagittarius line, and the direction towards the North Star (Polaris).
fr: Les trois axes correspondent respectivement à la ligne Poissons-Vierge, à la ligne Gémeaux-Sagittaire et à la direction vers l'étoile polaire (Polaris).
ja: 三軸はそれぞれ、うお座・おとめ座ライン、ふたご座・いて座ライン、北極星方向です。

# zoomable
source: You can rotate the display, zoom in, and zoom out.
fr: Vous pouvez faire pivoter l'affichage, zoomer et dézoomer.
ja: 表示は回転させたり、ズームイン、ズームアウトすることが可能です。

# planetsA
source: This page displays the trajectories of planetary probes using heliocentric ecliptic coordinates. Currently, the trajectory of Cassini-Huygens (up to 2004) is included. If you can assist with extending the trajectory of Cassini-Huygens and creating the trajectories for other probes, please contact us at the address below.
fr: Cette page affiche les trajectoires des sondes planétaires en utilisant les coordonnées écliptiques héliocentriques. Actuellement, la trajectoire de Cassini-Huygens (jusqu'en 2004) est incluse. Si vous pouvez aider à étendre la trajectoire de Cassini-Huygens et à créer les trajectoires pour d'autres sondes, veuillez nous contacter à l'adresse ci-dessous.
ja: これは、惑星探査船の航跡を日心黄道座標によって表示するページです。現在、カッシーニ・ホイヘンス（2004年まで）が掲載されています。カッシーニ・ホイヘンスの航跡延長、およびその他の探査機の航跡作成にご協力いただける方は、下記にご連絡ください。

# planetsB
source: We use heliocentric ecliptic coordinates with the Sun at the center. The concentric circles in the center represent the orbits of Mercury, Venus, Earth (in blue), Mars, and the asteroid belt.
fr: Nous utilisons les coordonnées écliptiques héliocentriques avec le Soleil au centre. Les cercles concentriques au centre représentent les orbites de Mercure, Vénus, la Terre (en bleu), Mars et la ceinture d'astéroïdes.
ja: 太陽を中心とする日心黄道座標を用いています。中央の同心円は、水星・金星・地球（青）・火星・小惑星帯の公転軌道です。

# planetsC
source: The two axes of the orbital plane correspond to the Pisces-Virgo line and the Gemini-Sagittarius line, while the orthogonal third axis represents the passage of time in Julian days. Therefore, the trajectories are displayed as spirals ascending with time.
fr: Les deux axes du plan orbital correspondent à la ligne Poissons-Vierge et à la ligne Gémeaux-Sagittaire, tandis que le troisième axe orthogonal représente le passage du temps en jours juliens. Par conséquent, les trajectoires sont affichées sous forme de spirales ascendantes au fil du temps.
ja: 公転軌道面の二軸は、うお座・おとめ座ライン、ふたご座・いて座ライン、直交する第三軸はユリウス日による時間経過を表示しています。したがって航跡は時間にしたがって上昇するらせん状に表示されています。

# dbViewA
source: This page displays cosmic events registered in the database using heliocentric ecliptic coordinates. When data is registered, it will be reflected in real-time.
fr: Cette page affiche les événements cosmiques enregistrés dans la base de données en utilisant les coordonnées écliptiques héliocentriques. Lorsqu'une donnée est enregistrée, elle sera reflétée en temps réel.
ja: これは、データベースに登録されている宇宙関連の事象を日心黄道座標によって表示するページです。データを登録いただきますと、リアルタイムで反映されます。

# dbViewB
source: We use heliocentric ecliptic coordinates with the Sun at the center. The concentric circles in the center represent the orbits of Mercury, Venus, Earth (in blue), Mars, and the asteroid belt. The two axes of the orbital plane correspond to the Pisces-Virgo line and the Gemini-Sagittarius line, while the orthogonal third axis represents the passage of time in Julian days. Therefore, each event is plotted at the intersection of the position of the specified celestial body and the time.
fr: Nous utilisons les coordonnées écliptiques héliocentriques avec le Soleil au centre. Les cercles concentriques au centre représentent les orbites de Mercure, Vénus, la Terre (en bleu), Mars et la ceinture d'astéroïdes. Les deux axes du plan orbital correspondent à la ligne Poissons-Vierge et à la ligne Gémeaux-Sagittaire, tandis que le troisième axe orthogonal représente le passage du temps en jours juliens. Par conséquent, chaque événement est tracé à l'intersection de la position du corps céleste spécifié et du temps.
ja: 太陽を中心とする日心黄道座標を用いています。中央の同心円は、水星・金星・地球（青）・火星・小惑星帯の公転軌道です。公転軌道面の二軸は、うお座・おとめ座ライン、ふたご座・いて座ライン、直交する第三軸はユリウス日による時間経過を表示しています。したがって各事象は、その事象が指定している天体の位置と時間の交点にプロットされます。

# dbViewC
source: Please note that some events may be displayed outside the visible area or may have overlapping text that is difficult to read. We are working on improvements.
fr: Veuillez noter que certains événements peuvent être affichés en dehors de la zone visible ou que le texte peut se chevaucher et être difficile à lire. Nous travaillons sur des améliorations.
ja: 一部枠外で表示されないもの、文字が交錯して読みにくいものなどがありますのでご了承ください。随時改善予定です。

# scalableA
source: This page plots and displays cosmic events registered in the database on an adjustable timeline. When you register data, it will be reflected in real-time.
fr: Cette page affiche et trace les événements cosmiques enregistrés dans la base de données sur une chronologie ajustable. Lorsque vous enregistrez des données, elles seront reflétées en temps réel.
ja: これは、データベースに登録されている宇宙関連の事象を伸縮可能な時間軸にプロットして表示するページです。データを登録すると、リアルタイムで反映されます。

# scalableB
source: Step 1 Select "All Items" to display all events in the database. Select "In Space" to display only the events tagged as cosmic. Please make sure to select one of these options.
fr: Étape 1 Appuyez toujours sur le bouton "Get" pour récupérer les données
ja: 手順１ “All Items”を選択すると、データベース内のすべての事象が表示されます。“In Space”を選択すると、宇宙にタグ付けされた事象だけが表示されます。必ずいずれかを選択してください。

# scalableC
source: Step 2 The five options at the bottom allow you to select the initial display area. You can scroll through the entire timeline after the initial display.
fr: Étape 2 Les cinq options en bas vous permettent de sélectionner la zone d'affichage initiale. Vous pouvez faire défiler l'ensemble de la chronologie après l'affichage initial.
ja: 手順２ 下部の五つの選択肢は、初期表示の領域を選択します。いずれを選んでも、表示後にスクロールで全領域を見ることができます。

# scalableD
source: The logarithmic timeline is set with the year 2100 as the base, with time flowing from top to bottom. Events are fixed on the timeline, so events that occurred close in time are displayed near each other, while events that occurred over a longer span of time are displayed further apart. Zooming in will show details of events from the same era, while zooming out provides an overview of longer periods.
fr: La chronologie logarithmique est réglée avec l'année 2100 comme base, le temps s'écoulant de haut en bas. Les événements sont fixés sur la chronologie, de sorte que les événements qui se sont produits à des moments proches sont affichés près les uns des autres, tandis que les événements qui se sont produits sur une plus longue période sont affichés plus loin. En zoomant, les détails des événements de la même époque s'affichent, tandis qu'un zoom arrière permet d'avoir une vue d'ensemble des périodes plus longues.
ja: 2100年を基点とする対数時間軸を設定し、上から下に時代が流れます。事象は時間軸に固定されているので、近接して起こった事象は近くに、時間を経て起こった事象は遠くに表示されます。ズームインすると、同時代の詳細が表示され、ズームアウトすると、長い時代を概観することができます。

# scalableE
source: If you find any events plotted in the wrong position, please contact us at the following.
fr: Si vous trouvez des événements mal placés sur la chronologie, veuillez nous contacter à l'adresse suivante.
ja: プロット位置が間違っている事象を見つけた場合は、以下にご連絡ください。
